{"modelTopology":{"class_name":"Sequential","config":{"name":"MAIN AI 1558","layers":[{"class_name":"Dense","config":{"units":300,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense24","trainable":true,"batch_input_shape":[null,514],"dtype":"float32"}},{"class_name":"Dense","config":{"units":200,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense25","trainable":true}},{"class_name":"Dense","config":{"units":200,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense26","trainable":true}},{"class_name":"Dense","config":{"units":100,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense27","trainable":true}},{"class_name":"Dense","config":{"units":50,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense28","trainable":true}},{"class_name":"Dense","config":{"units":20,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense29","trainable":true}},{"class_name":"Dense","config":{"units":1,"activation":"linear","use_bias":false,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense30","trainable":true}}]},"keras_version":"tfjs-layers 3.11.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.11.0","convertedBy":null,"weightsManifest":[{"paths":["./MAIN AI 1558.weights.bin"],"weights":[{"name":"dense_Dense24/kernel","shape":[514,300],"dtype":"float32"},{"name":"dense_Dense24/bias","shape":[300],"dtype":"float32"},{"name":"dense_Dense25/kernel","shape":[300,200],"dtype":"float32"},{"name":"dense_Dense25/bias","shape":[200],"dtype":"float32"},{"name":"dense_Dense26/kernel","shape":[200,200],"dtype":"float32"},{"name":"dense_Dense26/bias","shape":[200],"dtype":"float32"},{"name":"dense_Dense27/kernel","shape":[200,100],"dtype":"float32"},{"name":"dense_Dense27/bias","shape":[100],"dtype":"float32"},{"name":"dense_Dense28/kernel","shape":[100,50],"dtype":"float32"},{"name":"dense_Dense28/bias","shape":[50],"dtype":"float32"},{"name":"dense_Dense29/kernel","shape":[50,20],"dtype":"float32"},{"name":"dense_Dense29/bias","shape":[20],"dtype":"float32"},{"name":"dense_Dense30/kernel","shape":[20,1],"dtype":"float32"}]}]}